app/controllers/admin_controller.rb

  def qualify
    @programs = Program.find(:all, :conditions=>"event_status_id = 0", :order=>"date")
---
SELECT * FROM "programs" WHERE (event_status_id == 0) ORDER BY date

  def edit_program
    @program = Program.find_by_pid(params[:pid])
    if request.post? and @program.update_attributes(params[:program])
---
SELECT * FROM "programs" WHERE ("programs"."pid" = '201112161054402012-01-02') LIMIT 1
UPDATE "programs" SET "updated_at" = '2011-12-18 14:00:37', "name" = '大話合勤 2', "block_3" = 0, "event_status_id" = 2, "block_2" = 0, "date" = '2012-01-02', "audience" = '190' WHERE "id" = 1

  def faq
    @faq = Faq.new(params[:faq])
    @faqs = Faq.all
    if request.post? #and faq.save
      @faq.user_id = @user.id
      @faq.save
---
SELECT * FROM "faqs"
INSERT INTO "faqs" ("created_at", "updated_at", "user_id", "question", "answer") VALUES('2011-12-17 08:32:06', '2011-12-17 08:32:06', 1, '合勤廳之觀眾上下限為何？觀眾是否可超過觀眾席數量？', '合勤演藝廳內共設有199席觀眾座位以及1席無障礙座位。借用合勤廳並無觀眾最低數量的限制，但是依消防法規規定，入場人數不得超過觀眾席數量，也就是說，恕無法增加座位，或開放觀眾站立、坐在走道上。

  def edit_faq
    @faq = Faq.find(params[:id])
    if request.post? and @faq.update_attributes(params[:faq])
---
SELECT * FROM "faqs" WHERE ("faqs"."id" = 2)
UPDATE "faqs" SET "updated_at" = '2011-12-17 09:58:18', "question" = '合勤廳之觀眾上下限為何？觀眾是否可以超過觀眾席數量？' WHERE "id" = 2