app/controllers/auditorium_controller.rb

SELECT * FROM "programs" WHERE ("programs"."date" = '2012-01-01') ORDER BY block_1, block_2, block_3 LIMIT 1
---
  def query
    @date = params[:date]
    @date2 = Date.parse(@date)
    if (@date2 - Time.now.to_date) < 7
      flash[:message] = "查詢的日期已無法預約。"
      redirect_to(:action=>"query_by_month")
    end
    @check = 0
    @programs = Program.find_all_by_date(@date, :order=>"block_1, block_2, block_3")

SELECT * FROM "programs" WHERE ("programs"."date" = '2012-01-01')
INSERT INTO "club_activities" ("club", "program_id", "created_at", "remark", "updated_at") VALUES('f', 0, '2011-12-18 14:22:38', NULL, '2011-12-18 14:22:38')
INSERT INTO "contacts" ("name", "program_id", "created_at", "title", "updated_at", "user_id", "unit", "mobile", "phone", "fax", "email") VALUES('李柏穎', 7, '2011-12-18 14:22:54', '值班經理', '2011-12-18 14:22:54', 8, '合勤小組', '0939239326', '', '', 'leeboyin945@gmail.com')
INSERT INTO "programs" ("name", "pid", "created_at", "block_1", "updated_at", "block_2", "date", "event_status_id", "block_3", "audience") VALUES('大話合勤', '201112161047202012-01-02', '2011-12-16 02:48:49', 1, '2011-12-16 02:48:49', 1, '2012-01-02', 0, 1, '50')
---
  def reserve
    @page_title = '預約合勤廳'
    @date = params[:date]
    @p = Program.find_all_by_date(@date)
    @checks = [0, 0, 0]
    for p in @p
      @checks[0] = @checks[0] + p.block_1
      @checks[1] = @checks[1] + p.block_2
      @checks[2] = @checks[2] + p.block_3
    end
    @program = Program.new(params[:program])
    @contact = Contact.new(params[:contact])
    @club_activity = ClubActivity.create(:club=>'F')
    @contact.user = @user
    @program.contact = @contact
    @program.club_activity = @club_activity
    if request.post? and @program.save

SELECT * FROM "programs" WHERE ("programs"."pid" = '201112161054402012-01-02') LIMIT 1
INSERT INTO "blocks" ("program_id", "created_at", "remark", "updated_at", "time", "block_type_id") VALUES(3, '2011-12-16 03:11:23', NULL, '2011-12-16 03:11:23', '08:00-12:00', 1)
---
  def blocks
    @pid = params[:pid]
    @program = Program.find_by_pid(@pid)
    @blocks = @program.blocks
    @block = Block.new(params[:block])
    if request.post?
      @program.blocks << @block

SELECT * FROM "programs" WHERE ("programs"."pid" = '201112161054402012-01-02') LIMIT 1
SELECT * FROM "items"
INSERT INTO "program_items" ("program_id", "name", "created_at", "updated_at") VALUES(3, '爵士谷', '2011-12-16 03:58:20', '2011-12-16 03:58:20')
---
    def items
      @pid = params[:pid]
      @program = Program.find_by_pid(@pid)
      @items = Item.all
      @program_items = @program.program_items
      @program_item = ProgramItem.new(params[:program_item])
      if request.post?
        @program.program_items << @program_item

SELECT * FROM "items" WHERE ("items"."id" = 3)
SELECT * FROM "programs" WHERE ("programs"."pid" = '201112161054402012-01-02') LIMIT 1
INSERT INTO "program_items" ("program_id", "name", "created_at", "updated_at") VALUES(NULL, '巴森朵夫鋼琴', '2011-12-16 04:01:24', '2011-12-16 04:01:24')
---
    def add_item
      @item = Item.find(params[:id])
      @program = Program.find_by_pid(params[:pid])
      @program_item = ProgramItem.create(:name=>@item.name)

SELECT * FROM "programs" WHERE ("programs"."pid" = '201112161054402012-01-02') LIMIT 1
---
  def receipt
    @program = Program.find_by_pid(params[:pid])

SELECT * FROM "programs" WHERE ("programs"."pid" = '201112161047202012-01-02') LIMIT 1
---
  def edit_program
    @program = Program.find_by_pid(params[:pid])