app/controllers/home_controller.rb

  def faq
    @faqs = Faq.all
---
SELECT * FROM "faqs"