app/controllers/items_controller.rb

INSERT INTO "items" ("name", "created_at", "remark", "updated_at") VALUES('麥克風', '2011-12-15 19:50:24', '123', '2011-12-15 19:50:24')
---
  def new
    @item = Item.new(params[:item])
    if request.post? and @item.save