app/controllers/user_controller.rb

INSERT INTO "users" ("name", "created_at", "title", "updated_at", "power", "userid", "unit", "mobile", "phone", "fax", "password", "email") VALUES('李柏南', '2011-12-15 19:57:31', '研究助理', '2011-12-15 19:57:31', 5, '', '光電所', '88635715131', '88635715131', '', '123456', 'lishantreasure@gmail.com')
---
  def sign_up
    @user = User.new(params[:user])

    if request.post?
      # @user = User.new
      @user.userid = @user.email.tr("@","-at-").tr(".","-")
      @user.save

UPDATE "users" SET "updated_at" = '2011-12-17 10:08:04', "unit" = '合勤小組' WHERE "id" = 1
---
  def edit_profile
    if request.post? and @user.update_attributes(params[:user])